#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.cosmos will be created
  + resource "azurerm_resource_group" "cosmos" {
      + id       = (known after apply)
      + location = "centraulus"
      + name     = "cipool-cosmos-rg"
    }

  # azurerm_resource_group.helium-aci will be created
  + resource "azurerm_resource_group" "helium-aci" {
      + id       = (known after apply)
      + location = "centraulus"
      + name     = "cipool-webv-rg"
    }

  # azurerm_resource_group.helium-acr will be created
  + resource "azurerm_resource_group" "helium-acr" {
      + id       = (known after apply)
      + location = "centraulus"
      + name     = "cipool-acr-rg"
    }

  # azurerm_resource_group.helium-app will be created
  + resource "azurerm_resource_group" "helium-app" {
      + id       = (known after apply)
      + location = "centraulus"
      + name     = "cipool-app-rg"
    }

  # module.aci.azurerm_application_insights.appIns will be created
  + resource "azurerm_application_insights" "appIns" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + location                              = "centraulus"
      + name                                  = "webv-cipool"
      + resource_group_name                   = "cipool-webv-rg"
      + sampling_percentage                   = 100
    }

  # module.aci.azurerm_container_group.helium-aci["sherberttst"] will be created
  + resource "azurerm_container_group" "helium-aci" {
      + dns_name_label      = "aci-sherberttst"
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + ip_address          = (known after apply)
      + ip_address_type     = "Public"
      + location            = "centraulus"
      + name                = "sherberttst"
      + os_type             = "Linux"
      + resource_group_name = "cipool-webv-rg"
      + restart_policy      = "Always"
      + tags                = {
          + "environment" = "typescript"
        }

      + container {
          + commands = (known after apply)
          + cpu      = 0.5
          + image    = "retaildevcrew/webvalidate:beta"
          + memory   = 1.5
          + name     = "webv-sherberttst"

          + ports {
              + port     = 80
              + protocol = "TCP"
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.acr.azurerm_container_registry.helium-acr will be created
  + resource "azurerm_container_registry" "helium-acr" {
      + admin_enabled       = false
      + admin_password      = (sensitive value)
      + admin_username      = (known after apply)
      + id                  = (known after apply)
      + location            = "centraulus"
      + login_server        = (known after apply)
      + name                = "cipool"
      + network_rule_set    = (known after apply)
      + resource_group_name = "cipool-acr-rg"
      + sku                 = "Standard"
    }

  # module.db.azurerm_cosmosdb_account.cosmosdb will be created
  + resource "azurerm_cosmosdb_account" "cosmosdb" {
      + connection_strings                = (sensitive value)
      + enable_automatic_failover         = false
      + enable_multiple_write_locations   = false
      + endpoint                          = (known after apply)
      + id                                = (known after apply)
      + is_virtual_network_filter_enabled = false
      + kind                              = "GlobalDocumentDB"
      + location                          = "centraulus"
      + name                              = "cipool"
      + offer_type                        = "Standard"
      + primary_master_key                = (sensitive value)
      + primary_readonly_master_key       = (sensitive value)
      + read_endpoints                    = (known after apply)
      + resource_group_name               = "cipool-cosmos-rg"
      + secondary_master_key              = (sensitive value)
      + secondary_readonly_master_key     = (sensitive value)
      + write_endpoints                   = (known after apply)

      + consistency_policy {
          + consistency_level       = "Session"
          + max_interval_in_seconds = 5
          + max_staleness_prefix    = 100
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "centraulus"
        }
    }

  # module.db.azurerm_cosmosdb_sql_container.cosmosdb-movies["sherberttst"] will be created
  + resource "azurerm_cosmosdb_sql_container" "cosmosdb-movies" {
      + account_name        = "cipool"
      + database_name       = "imdb-sherberttst"
      + default_ttl         = (known after apply)
      + id                  = (known after apply)
      + name                = "movies"
      + partition_key_path  = "/partitionKey"
      + resource_group_name = "cipool-cosmos-rg"
      + throughput          = (known after apply)
    }

  # module.db.azurerm_cosmosdb_sql_database.cosmosdb-imdb["sherberttst"] will be created
  + resource "azurerm_cosmosdb_sql_database" "cosmosdb-imdb" {
      + account_name        = "cipool"
      + id                  = (known after apply)
      + name                = "imdb-sherberttst"
      + resource_group_name = "cipool-cosmos-rg"
      + throughput          = 1000
    }

  # module.db.docker_container.imdb-import["sherberttst"] will be created
  + resource "docker_container" "imdb-import" {
      + attach           = false
      + bridge           = (known after apply)
      + command          = (known after apply)
      + container_logs   = (known after apply)
      + entrypoint       = (known after apply)
      + env              = (known after apply)
      + exit_code        = (known after apply)
      + gateway          = (known after apply)
      + hostname         = (known after apply)
      + id               = (known after apply)
      + image            = "retaildevcrew/imdb-import"
      + ip_address       = (known after apply)
      + ip_prefix_length = (known after apply)
      + ipc_mode         = (known after apply)
      + log_driver       = (known after apply)
      + log_opts         = (known after apply)
      + logs             = false
      + must_run         = true
      + name             = "imdb-importersherberttst"
      + network_data     = (known after apply)
      + read_only        = false
      + restart          = "no"
      + rm               = true
      + shm_size         = (known after apply)
      + start            = true
      + user             = (known after apply)

      + labels {
          + label = (known after apply)
          + value = (known after apply)
        }
    }

  # module.db.docker_image.imdb-import will be created
  + resource "docker_image" "imdb-import" {
      + id            = (known after apply)
      + latest        = (known after apply)
      + name          = "retaildevcrew/imdb-import"
      + pull_triggers = [
          + "sha256:917bdf97862692f0e79103453e3dd0d7636e707d46a54d67c1ed6b7cdea7614a",
        ]
    }

  # module.web.azurerm_app_service.helium-webapp["sherberttst"] will be created
  + resource "azurerm_app_service" "helium-webapp" {
      + app_service_plan_id            = (known after apply)
      + app_settings                   = {
          + "DOCKER_ENABLE_CI"                    = "true"
          + "DOCKER_REGISTRY_SERVER_URL"          = "https://index.docker.io"
          + "KEYVAULT_NAME"                       = "cipool-sherberttst-kv"
          + "WEBSITES_ENABLE_APP_SERVICE_STORAGE" = "false"
        }
      + client_affinity_enabled        = (known after apply)
      + default_site_hostname          = (known after apply)
      + enabled                        = true
      + https_only                     = false
      + id                             = (known after apply)
      + location                       = "centraulus"
      + name                           = "cipool-sherberttst"
      + outbound_ip_addresses          = (known after apply)
      + possible_outbound_ip_addresses = (known after apply)
      + resource_group_name            = "cipool-app-rg"
      + site_credential                = (known after apply)
      + source_control                 = (known after apply)

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + logs {
          + application_logs {
              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      + site_config {
          + always_on                 = true
          + dotnet_framework_version  = "v4.0"
          + ftps_state                = (known after apply)
          + http2_enabled             = false
          + ip_restriction            = (known after apply)
          + linux_fx_version          = "DOCKER|retaildevcrew/helium-typescript:beta"
          + local_mysql_enabled       = (known after apply)
          + managed_pipeline_mode     = (known after apply)
          + min_tls_version           = (known after apply)
          + remote_debugging_enabled  = false
          + remote_debugging_version  = (known after apply)
          + scm_type                  = "None"
          + use_32_bit_worker_process = true
          + websockets_enabled        = (known after apply)
          + windows_fx_version        = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.web.azurerm_app_service_plan.helium-app-plan will be created
  + resource "azurerm_app_service_plan" "helium-app-plan" {
      + id                           = (known after apply)
      + kind                         = "linux"
      + location                     = "centraulus"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "cipool"
      + reserved                     = true
      + resource_group_name          = "cipool-app-rg"

      + sku {
          + capacity = (known after apply)
          + size     = "B2"
          + tier     = "Basic"
        }
    }

  # module.web.azurerm_application_insights.helium["sherberttst"] will be created
  + resource "azurerm_application_insights" "helium" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + location                              = "centraulus"
      + name                                  = "sherberttst"
      + resource_group_name                   = "cipool-app-rg"
      + sampling_percentage                   = 100
    }

  # module.web.azurerm_application_insights_web_test.Healthz-webtest["sherberttst"] will be created
  + resource "azurerm_application_insights_web_test" "Healthz-webtest" {
      + application_insights_id = (known after apply)
      + configuration           = (known after apply)
      + description             = "Webtest on appInsights"
      + enabled                 = true
      + frequency               = 300
      + geo_locations           = [
          + "us-ca-sjc-azr",
          + "us-tx-sn1-azr",
          + "us-il-ch1-azr",
          + "us-va-ash-azr",
          + "us-fl-mia-edge",
        ]
      + id                      = (known after apply)
      + kind                    = "ping"
      + location                = "centraulus"
      + name                    = "Healthz-sherberttst-appinsights"
      + resource_group_name     = "cipool-app-rg"
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 300
    }

  # module.web.azurerm_key_vault.kv["sherberttst"] will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = [
          + {
              + application_id          = null
              + certificate_permissions = null
              + key_permissions         = null
              + object_id               = "bcef84a3-c21f-4a7c-82f1-bb75b2bb6103"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Recover",
                  + "Backup",
                  + "Restore",
                ]
              + storage_permissions     = null
              + tenant_id               = "72f988bf-86f1-41af-91ab-2d7cd011db47"
            },
        ]
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = false
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "centraulus"
      + name                            = "cipool-sherberttst-kv"
      + resource_group_name             = "cipool-app-rg"
      + sku_name                        = "standard"
      + tenant_id                       = "72f988bf-86f1-41af-91ab-2d7cd011db47"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.web.azurerm_key_vault_access_policy.web_app["sherberttst"] will be created
  + resource "azurerm_key_vault_access_policy" "web_app" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "get",
          + "list",
        ]
      + tenant_id          = "72f988bf-86f1-41af-91ab-2d7cd011db47"
    }

  # module.web.azurerm_key_vault_secret.appinsights["sherberttst"] will be created
  + resource "azurerm_key_vault_secret" "appinsights" {
      + id           = (known after apply)
      + key_vault_id = (known after apply)
      + name         = "AppInsightsKey"
      + value        = (sensitive value)
      + version      = (known after apply)
    }

  # module.web.azurerm_key_vault_secret.cosmoscol["sherberttst"] will be created
  + resource "azurerm_key_vault_secret" "cosmoscol" {
      + id           = (known after apply)
      + key_vault_id = (known after apply)
      + name         = "CosmosCollection"
      + value        = (sensitive value)
      + version      = (known after apply)
    }

  # module.web.azurerm_key_vault_secret.cosmosdatabase["sherberttst"] will be created
  + resource "azurerm_key_vault_secret" "cosmosdatabase" {
      + id           = (known after apply)
      + key_vault_id = (known after apply)
      + name         = "CosmosDatabase"
      + value        = (sensitive value)
      + version      = (known after apply)
    }

  # module.web.azurerm_key_vault_secret.cosmoskey["sherberttst"] will be created
  + resource "azurerm_key_vault_secret" "cosmoskey" {
      + id           = (known after apply)
      + key_vault_id = (known after apply)
      + name         = "CosmosKey"
      + value        = (sensitive value)
      + version      = (known after apply)
    }

  # module.web.azurerm_key_vault_secret.cosmosurl["sherberttst"] will be created
  + resource "azurerm_key_vault_secret" "cosmosurl" {
      + id           = (known after apply)
      + key_vault_id = (known after apply)
      + name         = "CosmosUrl"
      + value        = (sensitive value)
      + version      = (known after apply)
    }

  # module.web.azurerm_monitor_action_group.helium-iac-AG will be created
  + resource "azurerm_monitor_action_group" "helium-iac-AG" {
      + enabled             = true
      + id                  = (known after apply)
      + name                = "alert_list"
      + resource_group_name = "cipool-app-rg"
      + short_name          = "cipool_alert"

      + email_receiver {
          + email_address           = "test@test.com"
          + name                    = "Alert-receiver-cipool"
          + use_common_alert_schema = false
        }
    }

  # module.web.azurerm_monitor_metric_alert.Healthz-webtest-alert["sherberttst"] will be created
  + resource "azurerm_monitor_metric_alert" "Healthz-webtest-alert" {
      + auto_mitigate       = false
      + description         = "Healthz-webtest-alert"
      + enabled             = true
      + frequency           = "PT5M"
      + id                  = (known after apply)
      + name                = "Healthz-sherberttst-webtestalert"
      + resource_group_name = "cipool-app-rg"
      + scopes              = (known after apply)
      + severity            = 2
      + window_size         = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation      = "Average"
          + metric_name      = "availabilityResults/availabilityPercentage"
          + metric_namespace = "Microsoft.Insights/components"
          + operator         = "LessThan"
          + threshold        = 1

          + dimension {
              + name     = "availabilityResult/location"
              + operator = "Include"
              + values   = [
                  + "*",
                ]
            }
        }
    }

  # module.web.azurerm_monitor_metric_alert.Requests-over600-alert["sherberttst"] will be created
  + resource "azurerm_monitor_metric_alert" "Requests-over600-alert" {
      + auto_mitigate       = false
      + description         = "Max Requests over 600."
      + enabled             = true
      + frequency           = "PT5M"
      + id                  = (known after apply)
      + name                = "sherberttst-appinsights-Requests-over600-Alert"
      + resource_group_name = "cipool-app-rg"
      + scopes              = (known after apply)
      + severity            = 3
      + window_size         = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation      = "Count"
          + metric_name      = "requests/count"
          + metric_namespace = "Microsoft.Insights/components"
          + operator         = "GreaterThan"
          + threshold        = 50
        }
    }

  # module.web.azurerm_monitor_metric_alert.Response-time-alert["sherberttst"] will be created
  + resource "azurerm_monitor_metric_alert" "Response-time-alert" {
      + auto_mitigate       = false
      + description         = "Server\u00a0Response\u00a0Time\u00a0over\u00a020ms."
      + enabled             = true
      + frequency           = "PT5M"
      + id                  = (known after apply)
      + name                = "sherberttst-appinsights-Response-Time-Alert"
      + resource_group_name = "cipool-app-rg"
      + scopes              = (known after apply)
      + severity            = 3
      + window_size         = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation      = "Average"
          + metric_name      = "requests/duration"
          + metric_namespace = "Microsoft.Insights/components"
          + operator         = "GreaterThan"
          + threshold        = 50
        }
    }

  # module.web.random_uuid.appsguid will be created
  + resource "random_uuid" "appsguid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.web.random_uuid.webtestguid will be created
  + resource "random_uuid" "webtestguid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 29 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Plan`, Action: `hashicorpterraform-github-actions2`, Working Directory: `src/root`, Workspace: `default`*
